---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetRestrictPalette(System.Boolean)
source: html/0785a691-501f-5647-cbd3-95cd75c5e707.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetRestrictPalette Method

Restrict the placement of parts to only use parts associated to the passed in fabrication palette identifier.

## Syntax (C#)
```csharp
public void SetRestrictPalette(
	bool restrictPalette
)
```

## Parameters
- **restrictPalette** (`System.Boolean`)